lib/crichton_test_service/app/controllers/drds_controller.rb

  def show
    @drd = Drd.find_by_uuid(params[:id])
---
SELECT "drds".* FROM "drds" WHERE "drds"."uuid" = '0f952dd8-7508-4781-a3e2-2a073c1d7f3e' LIMIT 1

  def index
    if (params[:search_term] == 'search')
      error = HyperError.new({ title: 'Not supported search term',
                          error_code: :search_term_is_not_supported,
                          http_status: 422,
                          details: 'You requested search but it is not a valid search_term',
                          controller: self})
      respond_with(error, status: 422)
    else
      @drds = Drds.find(params[:search_term])
---
SELECT "drds".* FROM "drds" WHERE (name LIKE '%foo%' or status LIKE '%foo%' or kind LIKE '%foo%')

  def create
    @drd = Drd.new(drd_params)
    if @drd.save
---
INSERT INTO "drds" ("built_at", "kind", "leviathan_url", "leviathan_uuid", "name", "status", "uuid") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @drd = Drd.find_by_uuid(params[:id])

    if @drd.update_attributes(drd_params)
---
SELECT "drds".* FROM "drds" WHERE "drds"."uuid" = '0f952dd8-7508-4781-a3e2-2a073c1d7f3e' LIMIT 1
UPDATE "drds" SET "kind" = 'sentinel' WHERE "drds"."uuid" = 'ced5878b-4992-4b81-ad37-f48a3252a020'

  def destroy
    @drd = Drd.find_by_uuid(params[:id])
    @drd.destroy
---
SELECT "drds".* FROM "drds" WHERE "drds"."uuid" = '0f952dd8-7508-4781-a3e2-2a073c1d7f3e' LIMIT 1
DELETE FROM "drds" WHERE "drds"."uuid" = ?  [["uuid", "0f952dd8-7508-4781-a3e2-2a073c1d7f3e"]]